; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v2 ?v4)
             (pred_5 ?v7 ?v1)
             (pred_2 ?v2 ?v1)
             (pred_4 ?v10 ?v2 )
	     (pred_10 ?v2)
             (pred_8 ?v13)
             (pred_12 ?v7)
             (pred_9 ?v1)
             (pred_3 ?v2)
             (pred_1 ?v7)
             (pred_7 ?v2)
             (pred_11 ))



(:action op_2
:parameters (?v6 ?v3 ?v8 ?v9)
:precondition (and (pred_8 ?v6) (pred_8 ?v3) (pred_12 ?v8) (pred_9 ?v9)
          (pred_6 ?v6 ?v3) (pred_5 ?v8 ?v9)
                   (pred_2 ?v3 ?v9) (pred_10 ?v6) 
                   (pred_3 ?v3) (pred_1 ?v8))
:effect (and  (pred_7 ?v3) (not (pred_3 ?v3))))


(:action op_1
:parameters (?v6 ?v11)
:precondition (and (pred_8 ?v6) (pred_8 ?v11)
               (pred_10 ?v6) (pred_6 ?v6 ?v11) (pred_7 ?v11))
:effect (and (pred_10 ?v11) (not (pred_10 ?v6))))

(:action op_5
:parameters (?v6 ?v8)
:precondition (and (pred_8 ?v6) (pred_12 ?v8) 
                  (pred_10 ?v6) (pred_4 ?v8 ?v6) (pred_11 ))
:effect (and (pred_1 ?v8)
   (not (pred_4 ?v8 ?v6)) (not (pred_11 ))))


(:action op_3
:parameters (?v6 ?v12 ?v5)
:precondition (and (pred_8 ?v6) (pred_12 ?v12) (pred_12 ?v5)
                  (pred_10 ?v6) (pred_1 ?v5) (pred_4 ?v12 ?v6))
:effect (and (pred_1 ?v12) (pred_4 ?v5 ?v6)
        (not (pred_1 ?v5)) (not (pred_4 ?v12 ?v6))))

(:action op_4
:parameters (?v6 ?v8)
:precondition (and (pred_8 ?v6) (pred_12 ?v8) 
                  (pred_10 ?v6) (pred_1 ?v8))
:effect (and (pred_11 ) (pred_4 ?v8 ?v6) (not (pred_1 ?v8)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_16 obj_13 obj_07 obj_15 obj_01 obj_22 obj_10 obj_20 obj_08 obj_04 obj_21 obj_12 obj_06 obj_05 obj_11 obj_19
    obj_09 obj_02 obj_03
    obj_14 obj_17 obj_18
    )

    (:init
       (pred_11)

       (pred_8 obj_16)
       (pred_8 obj_13)
       (pred_8 obj_07)
       (pred_8 obj_15)
       (pred_8 obj_01)
       (pred_8 obj_22)
       (pred_8 obj_10)
       (pred_8 obj_20)
       (pred_8 obj_08)
       (pred_8 obj_04)
       (pred_8 obj_21)
       (pred_8 obj_12)
       (pred_8 obj_06)
       (pred_8 obj_05)
       (pred_8 obj_11)
       (pred_8 obj_19)
       (pred_9 obj_09)
       (pred_9 obj_02)
       (pred_9 obj_03)
       (pred_12 obj_14)
       (pred_12 obj_17)
       (pred_12 obj_18)

       (pred_6 obj_16 obj_01)
       (pred_6 obj_16 obj_13)
       (pred_6 obj_13 obj_22)
       (pred_6 obj_13 obj_07)
       (pred_6 obj_13 obj_16)
       (pred_6 obj_07 obj_10)
       (pred_6 obj_07 obj_15)
       (pred_6 obj_07 obj_13)
       (pred_6 obj_15 obj_20)
       (pred_6 obj_15 obj_07)
       (pred_6 obj_01 obj_08)
       (pred_6 obj_01 obj_22)
       (pred_6 obj_01 obj_16)
       (pred_6 obj_22 obj_04)
       (pred_6 obj_22 obj_10)
       (pred_6 obj_22 obj_13)
       (pred_6 obj_22 obj_01)
       (pred_6 obj_10 obj_21)
       (pred_6 obj_10 obj_20)
       (pred_6 obj_10 obj_07)
       (pred_6 obj_10 obj_22)
       (pred_6 obj_20 obj_12)
       (pred_6 obj_20 obj_15)
       (pred_6 obj_20 obj_10)
       (pred_6 obj_08 obj_06)
       (pred_6 obj_08 obj_04)
       (pred_6 obj_08 obj_01)
       (pred_6 obj_04 obj_05)
       (pred_6 obj_04 obj_21)
       (pred_6 obj_04 obj_22)
       (pred_6 obj_04 obj_08)
       (pred_6 obj_21 obj_11)
       (pred_6 obj_21 obj_12)
       (pred_6 obj_21 obj_10)
       (pred_6 obj_21 obj_04)
       (pred_6 obj_12 obj_19)
       (pred_6 obj_12 obj_20)
       (pred_6 obj_12 obj_21)
       (pred_6 obj_06 obj_05)
       (pred_6 obj_06 obj_08)
       (pred_6 obj_05 obj_11)
       (pred_6 obj_05 obj_04)
       (pred_6 obj_05 obj_06)
       (pred_6 obj_11 obj_19)
       (pred_6 obj_11 obj_21)
       (pred_6 obj_11 obj_05)
       (pred_6 obj_19 obj_12)
       (pred_6 obj_19 obj_11)
       (pred_3 obj_19)
       (pred_3 obj_13)
       (pred_3 obj_05)
       (pred_2  obj_19 obj_09)
       (pred_2  obj_13 obj_02)
       (pred_2  obj_05 obj_03)
       (pred_7 obj_16)
       (pred_7 obj_07)
       (pred_7 obj_15)
       (pred_7 obj_01)
       (pred_7 obj_22)
       (pred_7 obj_10)
       (pred_7 obj_20)
       (pred_7 obj_08)
       (pred_7 obj_04)
       (pred_7 obj_21)
       (pred_7 obj_12)
       (pred_7 obj_06)
       (pred_7 obj_11)

       (pred_5  obj_14 obj_09)
       (pred_5  obj_17 obj_02)
       (pred_5  obj_18 obj_03)
       (pred_4 obj_14 obj_12)
       (pred_4 obj_17 obj_21)
       (pred_4 obj_18 obj_10)
       (pred_10 obj_20)
    )

    (:goal (and
       (pred_4 obj_18 obj_06)
    ))
(:constraints
  (always (not (pred_10 obj_22)))
)
)

; plan
1. (op_1 obj_20 obj_10)
   deleted: (pred_10 obj_20)
   added: (pred_10 obj_10)
   goals met: 0 of 1
2. (op_5 obj_10 obj_18)
   deleted: (pred_4 obj_18 obj_10) (pred_11)
   added: (pred_1 obj_18)
   goals met: 0 of 1
3. (op_1 obj_10 obj_21)
   deleted: (pred_10 obj_10)
   added: (pred_10 obj_21)
   goals met: 0 of 1
4. (op_1 obj_21 obj_04)
   deleted: (pred_10 obj_21)
   added: (pred_10 obj_04)
   goals met: 0 of 1
5. (op_1 obj_04 obj_08)
   deleted: (pred_10 obj_04)
   added: (pred_10 obj_08)
   goals met: 0 of 1
6. (op_1 obj_08 obj_06)
   deleted: (pred_10 obj_08)
   added: (pred_10 obj_06)
   goals met: 0 of 1
7. (op_4 obj_06 obj_18)
   deleted: (pred_1 obj_18)
   added: (pred_11) (pred_4 obj_18 obj_06)
   goals met: 1 of 1
